# ContourLabelEmpty Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SiteFailures..::..ContourLabelEmpty Property
BuiltInFailures..::..SiteFailures Class See Also
---
Contour Label doesn't intersect any contours.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ContourLabelEmpty { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContourLabelEmpty As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ContourLabelEmpty {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SiteFailures Class
Autodesk.Revit.DB Namespace